In [21]:
#1. Data Wrangling 1

In [22]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [23]:
import os
os.getcwd()

'C:\\Users\\SL4-08'

In [5]:
df = pd.read_csv("StudentsPerformance.csv")

In [4]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      996 non-null    object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [6]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        4
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [7]:
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [8]:
df.shape

(1000, 8)

In [9]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [10]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [14]:
#linear encoding

df['gender_encoded'] = df['gender'].cat.codes
df['lunch_encoded'] = df['lunch'].cat.codes
df['test_prep_encoded'] = df['test preparation course'].cat.codes
df['parent_edu_encoded'] = df['parental level of education'].cat.codes

In [15]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender_encoded,lunch_encoded,test_prep_encoded,parent_edu_encoded
0,female,group B,bachelor's degree,standard,none,72,72,74,0,1,1,1
1,female,group C,some college,standard,completed,69,90,88,0,1,0,4
2,female,group B,master's degree,standard,none,90,95,93,0,1,1,3
3,male,group A,associate's degree,free/reduced,none,47,57,44,1,0,1,0
4,male,group C,some college,standard,none,76,78,75,1,1,1,4

In [16]:
#one hot encoding

df['gender'] = df['gender'].astype('category')
df['lunch'] = df['lunch'].astype('category')
df['test preparation course'] = df['test preparation course'].astype('category')
df['parental level of education'] = df['parental level of education'].astype('category')

In [17]:
df_encoded = pd.get_dummies(df, columns=['gender', 'lunch', 'test preparation course', 'parental level of education'], drop_first=False, dtype=int)

In [18]:
df_encoded.head()

,race/ethnicity,math score,reading score,writing score,gender_encoded,lunch_encoded,test_prep_encoded,parent_edu_encoded,gender_female,gender_male,lunch_free/reduced,lunch_standard,test preparation course_completed,test preparation course_none,parental level of education_associate's degree,parental level of education_bachelor's degree,parental level of education_high school,parental level of education_master's degree,parental level of education_some college,parental level of education_some high school
0,group B,72,72,74,0,1,1,1,1,0,0,1,0,1,0,1,0,0,0,0
1,group C,69,90,88,0,1,0,4,1,0,0,1,1,0,0,0,0,0,1,0
2,group B,90,95,93,0,1,1,3,1,0,0,1,0,1,0,0,0,1,0,0
3,group A,47,57,44,1,0,1,0,0,1,1,0,0,1,1,0,0,0,0,0
4,group C,76,78,75,1,1,1,4,0,1,0,1,0,1,0,0,0,0,1,0

In [20]:
#2. Data Wrangling 2

In [24]:
print(df.isnull().sum())

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        4
math score                     0
reading score                  0
writing score                  0
gender_encoded                 0
lunch_encoded                  0
test_prep_encoded              0
parent_edu_encoded             0
dtype: int64

In [25]:
df['math score'].fillna(df['math score'].median(), inplace=True)
df['gender'].fillna(df['gender'].mode()[0], inplace=True)
df['lunch'] = df['lunch'].replace({'standard ': 'standard', 'free':'free/reduced'})

C:\Users\SL4-08\AppData\Local\Temp\ipykernel_19108\99946310.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['math score'].fillna(df['math score'].median(), inplace=True)
C:\Users\SL4-08\AppData\Local\Temp\ipykernel_19108\99946310.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['gender'].fillna(df['gender'].mode()[0], inplace=True)

In [26]:
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender_encoded,lunch_encoded,test_prep_encoded,parent_edu_encoded
0,female,group B,bachelor's degree,standard,none,72,72,74,0,1,1,1
1,female,group C,some college,standard,completed,69,90,88,0,1,0,4
2,female,group B,master's degree,standard,none,90,95,93,0,1,1,3
3,male,group A,associate's degree,free/reduced,none,47,57,44,1,0,1,0
4,male,group C,some college,standard,none,76,78,75,1,1,1,4
5,female,group B,associate's degree,standard,none,71,83,78,0,1,1,0
6,female,group B,some college,standard,completed,88,95,92,0,1,0,4
7,male,group B,some college,free/reduced,none,40,43,39,1,0,1,4
8,male,group D,high school,free/reduced,completed,64,64,67,1,0,0,2
9,female,group B,high school,free/reduced,none,38,60,50,0,0,1,2

In [27]:
Q1 = df['math score'].quantile(0.25)
Q3 = df['math score'].quantile(0.75)
IQR = Q3 - Q1

lower = Q1 - 1.5 * IQR
upper = Q3 + 1.5 * IQR

df['math score'] = df['math score'].clip(lower, upper)

In [28]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,gender_encoded,lunch_encoded,test_prep_encoded,parent_edu_encoded
0,female,group B,bachelor's degree,standard,none,72,72,74,0,1,1,1
1,female,group C,some college,standard,completed,69,90,88,0,1,0,4
2,female,group B,master's degree,standard,none,90,95,93,0,1,1,3
3,male,group A,associate's degree,free/reduced,none,47,57,44,1,0,1,0
4,male,group C,some college,standard,none,76,78,75,1,1,1,4

In [29]:
print(df['writing score'].skew())
df['writing_log'] = np.log1p(df['writing score'])
print(df['writing_log'].skew())

-0.28944397150761897
-1.3864652882781048